// クリップボードにコピー
function copyCP() {
    const input_text = document.getElementById("CP").value;
    navigator.clipboard.writeText(input_text).then(function() {
        // コピー成功時の処理
        alert("コピー成功");
    }).catch(function(error) {
        // コピー失敗時の処理
        alert("コピーに失敗しました: " + error);
    });
}

//恐怖心の二段階プルダウン
function change(e) {
    // 親セレクタで選択したカテゴリ番号
    const selectCategory = e.options[e.selectedIndex].dataset.category;
    // 子セレクタのoptionリスト
    const childs = document.getElementById('children').children;
    for(let i in childs) {
        const child = childs[i];
        // 子セレクタのoptionにdata-categoryが設定されている
        if(child.dataset !== undefined && child.dataset.category !== undefined) {
            // 親で選択したcategoryと異なればdisabledをtrueに、同じならfalseに変更
            child.disabled = child.dataset.category !== selectCategory ? true : false;
        }
    }
}

//スキル用パレットを作成する
/*
    1.好奇心からスキル番号を決定
    2.チェックの入ったボックスを取得
    3.順次スキルのチャパレを作成
        3-1.チェックの入ったデータとスキルを比較（チェックの入った縦番号-スキルの縦番号)+（チェックの入った横番号-スキルの横番号)+5 
            ※絶対値で計算を行う
        3-2.上記3-1をチェックの入ったボックス全てで行う
        3-3.スキルのカラムは[(技能名),(横),(縦),(代用技能),(判定数)]になっている。
            代用技能・判定数がnullの場合はそのまま代入、nullでない場合は判定数を比較し、小さい方を採用する。
    4.CPに表示させる。2D6>=13 【痛み （代用：カメラ）】\n
*/
function makeCP(){
    let all_skill = setSkillNum() //好奇心からスキル番号を決定
    let skills = getCheckedCheckboxes() //チェックの入ったボックスを取得
    let setCP ="ST 【シーン表】\nHJST 【本当は怖い現代日本シーン表】\nMTST 【狂騒の二〇年代シーン表】\nDVST 【暗黒のヴィクトリアシーン表】\nDT 【形用表】\nBT 【本体表】\nPT 【部位表】\nFT 【感情表】\nJT 【職業表】\nBET 【バッドエンド表】\nRCT 【ランダム分野表】\nRTNn 【ランダム特技表(n:分野番号、省略可能)】\nCHT 【ホラースケープ：会話】\nVHT 【ホラースケープ：街中】\nIHT 【ホラースケープ：不意訪問】\nRHT 【ホラースケープ：廃墟遭遇】\nEMT 【ホラースケープ：山林】\nEAT 【ホラースケープ：海辺】\nRET 【反応表】\nD66 \n"
    let all_skill_number = all_skill.length 
    let skill_number = skills.length
    

    //スキル作成
    for (let i = 0; i < skill_number ; i++){
          for (let j = 0; j < all_skill_number ; j++){
                let k = Math.abs(all_skill[j][1]-skills[i][1]) + Math.abs(all_skill[j][2]-skills[i][2]) + 5

              if(!all_skill[j][4]){
                  all_skill[j][3] = skills[i][0]
                  all_skill[j][4] = k
              }else{
                  if(all_skill[j][4] > k){
                        all_skill[j][3] = skills[i][0]
                        all_skill[j][4] = k
                  }
              }  
          }
    }
    
    //恐怖心の設定
    let fear = document.getElementById('children').value;
    for(let n = 0; n < all_skill.length; n++){
        if(all_skill[n][0] === fear){
            all_skill[n][4] += 2; // skillNum[n][4]の値に+2 
            all_skill[n][0] += "(恐怖心)"; // "(恐怖心)"を追加
        } 
    }

    //スキルを1文にする
    for(let i = 0; i < all_skill_number ; i++){
        let cp =""
        if(all_skill[i][3] === all_skill[i][0]){
            cp = "2D6>=5 【" + all_skill[i][0] + "】\n"
            setCP += cp
        }else{
            cp ="2D6>=" +all_skill[i][4] +" 【" + all_skill[i][0] +"(代用："+all_skill[i][3] + ")】\n"
            setCP += cp
        }
            
    }
    document.getElementById('CP').value = setCP
}



//チェックの入ったスキルを取得する
function getCheckedCheckboxes() {
            //スキル番号を取得
            let skillNum =　setSkillNum()
            // チェックされているチェックボックスを取得
            const checkboxes = document.querySelectorAll('input[name="checkbox"]:checked');
            const checkedValues = [];
            checkboxes.forEach((checkbox) => {
                const result = skillNum.find(item => item[0] === checkbox.value);
                if (result) {
                    checkedValues.push(result);
                }
            });
            console.log(checkedValues);
            return checkedValues;

        }


//好奇心でスキルに番号振りする
function setSkillNum(){
    let skillNum =[]
    let curiosity  = document.getElementById('curiosity').value;

    switch(curiosity){
        case "暴力":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",2,2,,],["悦び",2,3,,],["憂い",2,4,,],["恥じらい",2,5,,],["笑い",2,6,,],["我慢",2,7,,],["驚き",2,8,,],["怒り",2,9,,],["恨み",2,10,,],["哀しみ",2,11,,],["愛",2,12,,],["痛み",4,2,,],["官能",4,3,,],["手触り",4,4,,],["におい",4,5,,],["味",4,6,,],["物音",4,7,,],["情景",4,8,,],["追跡",4,9,,],["芸術",4,10,,],["第六感",4,11,,],["物陰",4,12,,],["分解",6,2,,],["電子機器",6,3,,],["整理",6,4,,],["薬品",6,5,,],["効率",6,6,,],["メディア",6,7,,],["カメラ",6,8,,],["乗物",6,9,,],["機械",6,10,,],["罠",6,11,,],["兵器",6,12,,],["物理学",8,2,,],["数学",8,3,,],["化学",8,4,,],["生物学",8,5,,],["医学",8,6,,],["教養",8,7,,],["人類学",8,8,,],["歴史",8,9,,],["民俗学",8,10,,],["考古学",8,11,,],["天文学",8,12,,],["時間",10,2,,],["混沌",10,3,,],["深海",10,4,,],["死",10,5,,],["霊魂",10,6,,],["魔術",10,7,,],["暗黒",10,8,,],["終末",10,9,,],["夢",10,10,,],["地底",10,11,,],["宇宙",10,12,,]];
            break;
        
        case "情動":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",2,2,,],["悦び",2,3,,],["憂い",2,4,,],["恥じらい",2,5,,],["笑い",2,6,,],["我慢",2,7,,],["驚き",2,8,,],["怒り",2,9,,],["恨み",2,10,,],["哀しみ",2,11,,],["愛",2,12,,],["痛み",3,2,,],["官能",3,3,,],["手触り",3,4,,],["におい",3,5,,],["味",3,6,,],["物音",3,7,,],["情景",3,8,,],["追跡",3,9,,],["芸術",3,10,,],["第六感",3,11,,],["物陰",3,12,,],["分解",5,2,,],["電子機器",5,3,,],["整理",5,4,,],["薬品",5,5,,],["効率",5,6,,],["メディア",5,7,,],["カメラ",5,8,,],["乗物",5,9,,],["機械",5,10,,],["罠",5,11,,],["兵器",5,12,,],["物理学",7,2,,],["数学",7,3,,],["化学",7,4,,],["生物学",7,5,,],["医学",7,6,,],["教養",7,7,,],["人類学",7,8,,],["歴史",7,9,,],["民俗学",7,10,,],["考古学",7,11,,],["天文学",7,12,,],["時間",9,2,,],["混沌",9,3,,],["深海",9,4,,],["死",9,5,,],["霊魂",9,6,,],["魔術",9,7,,],["暗黒",9,8,,],["終末",9,9,,],["夢",9,10,,],["地底",9,11,,],["宇宙",9,12,,]];
            break;
            
        case "知覚":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",3,2,,],["悦び",3,3,,],["憂い",3,4,,],["恥じらい",3,5,,],["笑い",3,6,,],["我慢",3,7,,],["驚き",3,8,,],["怒り",3,9,,],["恨み",3,10,,],["哀しみ",3,11,,],["愛",3,12,,],["痛み",4,2,,],["官能",4,3,,],["手触り",4,4,,],["におい",4,5,,],["味",4,6,,],["物音",4,7,,],["情景",4,8,,],["追跡",4,9,,],["芸術",4,10,,],["第六感",4,11,,],["物陰",4,12,,],["分解",5,2,,],["電子機器",5,3,,],["整理",5,4,,],["薬品",5,5,,],["効率",5,6,,],["メディア",5,7,,],["カメラ",5,8,,],["乗物",5,9,,],["機械",5,10,,],["罠",5,11,,],["兵器",5,12,,],["物理学",7,2,,],["数学",7,3,,],["化学",7,4,,],["生物学",7,5,,],["医学",7,6,,],["教養",7,7,,],["人類学",7,8,,],["歴史",7,9,,],["民俗学",7,10,,],["考古学",7,11,,],["天文学",7,12,,],["時間",9,2,,],["混沌",9,3,,],["深海",9,4,,],["死",9,5,,],["霊魂",9,6,,],["魔術",9,7,,],["暗黒",9,8,,],["終末",9,9,,],["夢",9,10,,],["地底",9,11,,],["宇宙",9,12,,]];
            break;
            
        case "技術":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",3,2,,],["悦び",3,3,,],["憂い",3,4,,],["恥じらい",3,5,,],["笑い",3,6,,],["我慢",3,7,,],["驚き",3,8,,],["怒り",3,9,,],["恨み",3,10,,],["哀しみ",3,11,,],["愛",3,12,,],["痛み",5,2,,],["官能",5,3,,],["手触り",5,4,,],["におい",5,5,,],["味",5,6,,],["物音",5,7,,],["情景",5,8,,],["追跡",5,9,,],["芸術",5,10,,],["第六感",5,11,,],["物陰",5,12,,],["分解",6,2,,],["電子機器",6,3,,],["整理",6,4,,],["薬品",6,5,,],["効率",6,6,,],["メディア",6,7,,],["カメラ",6,8,,],["乗物",6,9,,],["機械",6,10,,],["罠",6,11,,],["兵器",6,12,,],["物理学",7,2,,],["数学",7,3,,],["化学",7,4,,],["生物学",7,5,,],["医学",7,6,,],["教養",7,7,,],["人類学",7,8,,],["歴史",7,9,,],["民俗学",7,10,,],["考古学",7,11,,],["天文学",7,12,,],["時間",9,2,,],["混沌",9,3,,],["深海",9,4,,],["死",9,5,,],["霊魂",9,6,,],["魔術",9,7,,],["暗黒",9,8,,],["終末",9,9,,],["夢",9,10,,],["地底",9,11,,],["宇宙",9,12,,]];
            break;
            
        case "知識":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",3,2,,],["悦び",3,3,,],["憂い",3,4,,],["恥じらい",3,5,,],["笑い",3,6,,],["我慢",3,7,,],["驚き",3,8,,],["怒り",3,9,,],["恨み",3,10,,],["哀しみ",3,11,,],["愛",3,12,,],["痛み",5,2,,],["官能",5,3,,],["手触り",5,4,,],["におい",5,5,,],["味",5,6,,],["物音",5,7,,],["情景",5,8,,],["追跡",5,9,,],["芸術",5,10,,],["第六感",5,11,,],["物陰",5,12,,],["分解",7,2,,],["電子機器",7,3,,],["整理",7,4,,],["薬品",7,5,,],["効率",7,6,,],["メディア",7,7,,],["カメラ",7,8,,],["乗物",7,9,,],["機械",7,10,,],["罠",7,11,,],["兵器",7,12,,],["物理学",8,2,,],["数学",8,3,,],["化学",8,4,,],["生物学",8,5,,],["医学",8,6,,],["教養",8,7,,],["人類学",8,8,,],["歴史",8,9,,],["民俗学",8,10,,],["考古学",8,11,,],["天文学",8,12,,],["時間",9,2,,],["混沌",9,3,,],["深海",9,4,,],["死",9,5,,],["霊魂",9,6,,],["魔術",9,7,,],["暗黒",9,8,,],["終末",9,9,,],["夢",9,10,,],["地底",9,11,,],["宇宙",9,12,,]];
            break;
            
        case "怪異":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",3,2,,],["悦び",3,3,,],["憂い",3,4,,],["恥じらい",3,5,,],["笑い",3,6,,],["我慢",3,7,,],["驚き",3,8,,],["怒り",3,9,,],["恨み",3,10,,],["哀しみ",3,11,,],["愛",3,12,,],["痛み",5,2,,],["官能",5,3,,],["手触り",5,4,,],["におい",5,5,,],["味",5,6,,],["物音",5,7,,],["情景",5,8,,],["追跡",5,9,,],["芸術",5,10,,],["第六感",5,11,,],["物陰",5,12,,],["分解",7,2,,],["電子機器",7,3,,],["整理",7,4,,],["薬品",7,5,,],["効率",7,6,,],["メディア",7,7,,],["カメラ",7,8,,],["乗物",7,9,,],["機械",7,10,,],["罠",7,11,,],["兵器",7,12,,],["物理学",9,2,,],["数学",9,3,,],["化学",9,4,,],["生物学",9,5,,],["医学",9,6,,],["教養",9,7,,],["人類学",9,8,,],["歴史",9,9,,],["民俗学",9,10,,],["考古学",9,11,,],["天文学",9,12,,],["時間",10,2,,],["混沌",10,3,,],["深海",10,4,,],["死",10,5,,],["霊魂",10,6,,],["魔術",10,7,,],["暗黒",10,8,,],["終末",10,9,,],["夢",10,10,,],["地底",10,11,,],["宇宙",10,12,,]];
            break;

        case "":
            skillNum = [["焼却",1,2,,],["拷問",1,3,,],["緊縛",1,4,,],["脅す",1,5,,],["破壊",1,6,,],["殴打",1,7,,],["切断",1,8,,],["刺す",1,9,,],["射撃",1,10,,],["戦争",1,11,,],["埋葬",1,12,,],["恋",3,2,,],["悦び",3,3,,],["憂い",3,4,,],["恥じらい",3,5,,],["笑い",3,6,,],["我慢",3,7,,],["驚き",3,8,,],["怒り",3,9,,],["恨み",3,10,,],["哀しみ",3,11,,],["愛",3,12,,],["痛み",5,2,,],["官能",5,3,,],["手触り",5,4,,],["におい",5,5,,],["味",5,6,,],["物音",5,7,,],["情景",5,8,,],["追跡",5,9,,],["芸術",5,10,,],["第六感",5,11,,],["物陰",5,12,,],["分解",7,2,,],["電子機器",7,3,,],["整理",7,4,,],["薬品",7,5,,],["効率",7,6,,],["メディア",7,7,,],["カメラ",7,8,,],["乗物",7,9,,],["機械",7,10,,],["罠",7,11,,],["兵器",7,12,,],["物理学",9,2,,],["数学",9,3,,],["化学",9,4,,],["生物学",9,5,,],["医学",9,6,,],["教養",9,7,,],["人類学",9,8,,],["歴史",9,9,,],["民俗学",9,10,,],["考古学",9,11,,],["天文学",9,12,,],["時間",11,2,,],["混沌",11,3,,],["深海",11,4,,],["死",11,5,,],["霊魂",11,6,,],["魔術",11,7,,],["暗黒",11,8,,],["終末",11,9,,],["夢",11,10,,],["地底",11,11,,],["宇宙",11,12,,]];
            break;
    }
    return skillNum;

}
